#                                                                                                             
#  88888888ba   88888888ba   88888888888  I8,        8        ,8I  88888888888  88  88           88888888888  
#  88      "8b  88      "8b  88           `8b       d8b       d8'  88           88  88           88           
#  88      ,8P  88      ,8P  88            "8,     ,8"8,     ,8"   88           88  88           88           
#  88aaaaaa8P'  88aaaaaa8P'  88aaaaa        Y8     8P Y8     8P    88aaaaa      88  88           88aaaaa      
#  88""""""8b,  88""""88'    88"""""        `8b   d8' `8b   d8'    88"""""      88  88           88"""""      
#  88      `8b  88    `8b    88              `8a a8'   `8a a8'     88           88  88           88           
#  88      a8P  88     `8b   88               `8a8'     `8a8'      88           88  88           88           
#  88888888P"   88      `8b  88888888888       `8'       `8'       88           88  88888888888  88888888888  
#                                                                                                             

# Taps
tap 'homebrew/cask-fonts'
tap 'mongodb/brew'
tap 'localsend/localsend'
tap 'mczachurski/wallpapper'

# Dev
brew 'python3'
# brew 'node'  # can be replaced by nvm, because nvm will handle version management
brew 'nvm'
brew 'mongodb-community'
brew 'rust'
brew 'pdm'
brew 'micro'

# Tools
brew 'yt-dlp'
brew 'ffmpeg'
brew 'displayplacer'
brew 'wallpapper'
brew 'ollama'

# Customization
brew 'neofetch'
brew 'fortune'
brew 'cowsay'

# Font Casks
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-roboto'
cask 'font-inter'
cask 'font-lato'
cask 'font-raleway'
cask 'font-rubik'

# App Casks
cask 'arc'
cask 'google-chrome'
cask 'tor-browser'
cask 'thunderbird'
cask 'microsoft-office'
cask 'spotify'
cask 'notion'
cask 'vlc'
cask 'teamviewer'
cask 'zoom'
cask 'rekordbox'
cask 'ultimaker-cura'
cask 'obs'
cask 'blender'
cask 'localsend'

# Tool Casks
cask 'raycast'
cask 'alt-tab'
cask 'nightfall'
cask 'linearmouse'
# get v2 from github since v3 is paid after a month
# cask 'mac-mouse-fix'
cask 'itsycal'
cask 'moom'
cask 'aldente'
cask 'appcleaner'
cask 'the-unarchiver'
cask 'bitwarden'
cask 'openinterminal'
cask 'tailscale'
cask 'balenaetcher'
cask 'rustdesk'
cask 'disk-drill'
cask 'soduto'

# Quicklook Casks (https://github.com/sindresorhus/quick-look-plugins)
cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'betterzip'

# Dev Casks
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'docker'
cask 'postman'
cask 'cyberduck'
cask 'mongodb-compass'
cask 'termius'
cask 'openscad'
cask 'unity'
cask 'scrcpy'

# Social Casks
cask 'signal'
cask 'whatsapp'
cask 'discord'
cask 'telegram'

# Gaming Casks
cask 'parsec'
cask 'minecraft'
cask 'steam'
cask 'battle-net'
cask 'epic-games'

# Mac App Store Apps
# mas 'AusweisApp', id: 948660805
# mas 'Unsplash Wallpapers', id: 1284863847
# mas 'Amphetamine', id: 937984704
# mas 'Notability', id: 360593530
# mas 'Plash'
