#                                                                                                             
#  88888888ba   88888888ba   88888888888  I8,        8        ,8I  88888888888  88  88           88888888888  
#  88      "8b  88      "8b  88           `8b       d8b       d8'  88           88  88           88           
#  88      ,8P  88      ,8P  88            "8,     ,8"8,     ,8"   88           88  88           88           
#  88aaaaaa8P'  88aaaaaa8P'  88aaaaa        Y8     8P Y8     8P    88aaaaa      88  88           88aaaaa      
#  88""""""8b,  88""""88'    88"""""        `8b   d8' `8b   d8'    88"""""      88  88           88"""""      
#  88      `8b  88    `8b    88              `8a a8'   `8a a8'     88           88  88           88           
#  88      a8P  88     `8b   88               `8a8'     `8a8'      88           88  88           88           
#  88888888P"   88      `8b  88888888888       `8'       `8'       88           88  88888888888  88888888888  
#                                                                                                             

# Taps
# tap 'homebrew/cask-fonts'
tap 'mongodb/brew'
tap 'localsend/localsend'
tap 'mczachurski/wallpapper'

# Dev
brew 'python3'
# brew 'node'  # can be replaced by nvm, because nvm will handle version management
brew 'nvm'
brew 'mongodb-community'
brew 'rust'
brew 'pdm'
brew 'micro'
brew 'ccache'
brew 'cocoapods'
brew 'gradle'
brew 'mongocli'
brew 'ninja'
brew 'openjdk@17'

# Tools
brew 'yt-dlp'  # youtube download
brew 'ffmpeg'  # swiss knife for media
brew 'displayplacer'  # screen arrangement
brew 'wallpapper'  # mac os dynamic wallpaper creation
brew 'ollama'  # llm management
brew 'cheat'  # cli command help
brew 'tldr'  # cli command help
brew 'htop'  # system usage
brew 'iftop'  # network usage
brew 'mkvtoolnix'  # media conversion
brew 'ncdu'  # cli disk usage tool like tree size/disk-drill
brew 'nmap'  # portscan etc
brew 'speedtest-cli'  # speedtest
brew 'subfinder'  # subdomain scan
brew 'telnet'  # telnet
brew 'thefuck'  # fix commands
brew 'tree'  # directory tree view
brew 'wget'  # web download tool

# Customization
brew 'fortune'  # random quotes
brew 'cowsay'  # cowsay

# Font Casks
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-roboto'
cask 'font-inter'
cask 'font-lato'
cask 'font-raleway'
cask 'font-rubik'
cask 'font-manrope'
cask 'font-open-sans'

# App Casks
cask 'zen-browser'
cask 'firefox'
cask 'google-chrome'
# cask 'tor-browser'
cask 'thunderbird'
cask 'microsoft-office'
cask 'spotify'
cask 'notion'
cask 'vlc'
cask 'teamviewer'
cask 'zoom'
cask 'rekordbox'
cask 'ultimaker-cura'
cask 'obs'
cask 'blender'
cask 'localsend'
cask 'visual-studio-code'
cask 'obsidian'

# Tool Casks
cask 'raycast'
cask 'alt-tab'
cask 'nightfall'
cask 'linearmouse'
# get v2 from github since v3 is paid after a month
# cask 'mac-mouse-fix'
cask 'itsycal'
cask 'moom'
cask 'aldente'
cask 'appcleaner'
cask 'the-unarchiver'
cask 'bitwarden'
cask 'openinterminal'
cask 'tailscale'
cask 'balenaetcher'
cask 'rustdesk'
cask 'disk-drill'
cask 'soduto'
# cask 'torguard'
cask 'audacity'
cask 'raspberry-pi-imager'
cask 'mochi-diffusion'
cask 'handbrake-app'
# cask 'hazeover'
cask 'imaging-edge-webcam'
cask 'stats'

# Quicklook Casks (https://github.com/sindresorhus/quick-look-plugins)
cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'betterzip'

# Dev Casks
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'docker'
cask 'docker-desktop'
cask 'postman'
cask 'cyberduck'
cask 'mongodb-compass'
cask 'termius'
cask 'openscad'
cask 'unity'
cask 'unity-hub'
# cask 'scrcpy'
cask 'android-platform-tools'
cask 'github'
cask 'bambu-studio'

# Social Casks
cask 'signal'
cask 'whatsapp'
cask 'discord'
cask 'telegram'
cask 'microsoft-teams'

# Gaming Casks
cask 'parsec'
cask 'minecraft'
cask 'modrinth'
cask 'steam'
cask 'battle-net'
cask 'epic-games'
# cask 'logitech-g-hub'
cask 'whisky'

# Mac App Store Apps
# mas 'AusweisApp', id: 948660805
# mas 'Unsplash Wallpapers', id: 1284863847
# mas 'Amphetamine', id: 937984704
# mas 'Notability', id: 360593530
# mas 'Plash'
